//=============================================================================
//
// ブロック処理 [block.h]
// Author : 呉優
//
//=============================================================================
#pragma once

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define		BLOCK_DATA			('#')			// ノーマルブロック
#define		BOMB_DATA			('Q')			// 爆弾ブロック
#define		POW_DATA			('P')			// パワーアップブロック
#define		MAXX_DATA			('M')			// 増殖ブロック

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitBlock(void);
void UninitBlock(void);
void UpdateBlock(void);
void DrawBlock(void);

// ブロックを1行追加
void AddBlockLine(void);

// ブロックを消す
void DeleteBlock(int x, int y, int power);

// 先頭ブロックデータを解放
void ClearTopLine(void);

// 限界まで下りたブロックを解放、爆弾が含まれていたらゲームオーバー
void ReleaseDownLine(void);

// 爆弾ブロック生成
void CreateBomb(int idx);

// 爆弾ブロック作動
void DoBomb(int idx);

// パワーアップブロック生成
void CreatePOW(int idx);

// パワーアップブロック作動
void DoPOW(void);