//=============================================================================
//
// フィールド処理 [field.h]
// Author : 呉優
//
//=============================================================================
#pragma once

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define		FIELD_H				(24)		// ゲームフィールドの縦サイズ(天井、床含め)
#define		FIELD_W				(60)		// ゲームフィールドの横サイズ(壁含め)

#define		WALL_DATA			('|')
#define		CEILING_DATA		('-')
#define		CORNER_DATA			('+')

#define		DEAD_LINE			(2)			// ゲームオーバーするブロックのライン

//*****************************************************************************
// 構造体定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitField(void);
void UninitField(void);
void UpdateField(void);
void DrawField(void);

// フィールドを取得
char* GetField(void);

// 指定した座標を取得
char GetField(int x, int y);


// 指定した座標に1文字を書き込む
void SetField(int x, int y, char data);

// 指定した座標に文字列を書き込む
void SetField(int x, int y, char* data);


// 指定した座標をチェック
// 物がなければ0を、あれば1を返す
int CheckField(int x, int y);

// 指定した座標をチェック
// 引数の物でなければ0を、であれば1を返す
int CheckField(int x, int y, char data);