//=============================================================================
//
// メイン処理 [main.cpp]
// Author : 呉優
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "main.h"
#include "field.h"
#include "ball.h"
#include "block.h"
#include "bar.h"
#include "input.h"
#include "boundPoint.h"
#include "score.h"
#include "result.h"
#include "title.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define		FPS_VER			(1)			// FPSの増分

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************
int g_Mode = MODE_TITLE;
int g_FPS;

//=============================================================================
// メイン関数
//=============================================================================
int main(void) {

	Init();							// 初期化処理

	while (GetMode() < MODE_MAX) {

		Update();					// 更新処理
 		Draw();						// 描画処理

		Sleep(1000 / g_FPS);		// FPS制御
	}

	Uninit();						// 終了処理
}

//=============================================================================
// 初期化処理
//=============================================================================
void Init(void) {

	// ランダム初期化
	srand((unsigned)time(NULL));

	g_FPS = FPS_DEFAULT;

	InitInput();
		
	SetMode(MODE_TITLE);
}
//=============================================================================
// 終了処理
//=============================================================================
void Uninit(void) {

	UninitInput();
}

//=============================================================================
// 更新処理
//=============================================================================
void Update(void) {

	switch (g_Mode) {
	case MODE_TITLE:
		UpdateTitle();
		break;

	case MODE_GAME:		// ゲーム画面の更新
		UpdateBoundPoint();

		UpdateBlock();
		UpdateBar();
		UpdateBall();

		UpdateScore();

		UpdateField();
		break;

	case MODE_RESULT:
		UpdateResult();
		break;
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void Draw(void) {

	switch (g_Mode) {
	case MODE_TITLE:
		DrawTitle();
		break;

	case MODE_GAME:		// ゲーム画面の描画
		DrawBoundPoint();

		DrawBlock();
		DrawBar();
		DrawBall();

		DrawScore();

		DrawField();
		break;

	case MODE_RESULT:
		DrawResult();
		break;
	}
}

//=============================================================================
// モードの設定
//=============================================================================
void SetMode(int mode) {

	UninitTitle();		// タイトルの終了処理

	UninitField();		// フィールドの終了処理
	UninitBall();		// ボールの終了処理
	UninitBlock();		// ブロックの終了処理
	UninitBar();		// バーの終了処理
	UninitBoundPoint();	// 着地点の終了処理
	UninitScore();		// スコアの終了処理

	UninitResult();		// リザルトの終了処理

	g_Mode = mode;

	switch (g_Mode) {
	case MODE_TITLE:	// タイトル画面の初期化処理
		InitTitle();
		SetFPS(FPS_TITLE);
		break;

	case MODE_GAME:		// ゲーム画面の初期化処理
		InitField();
		InitBall();
		InitBlock();
		InitBar();
		InitBoundPoint();
		InitScore();
		SetFPS(FPS_DEFAULT);
		break;

	case MODE_RESULT:	// リザルト画面の初期化処理
		InitResult();
		SetFPS(FPS_DEFAULT);
		break;
	}
}

//=============================================================================
// モードの取得
//=============================================================================
int GetMode(void) {
	return g_Mode;
}

//=============================================================================
// FPSをセット
//=============================================================================
void SetFPS(int fps) {
	g_FPS = fps;
}

//=============================================================================
// FPSを取得
//=============================================================================
int GetFPS(void) {
	return g_FPS;
}

//=============================================================================
// FPS増加
//=============================================================================
void FPSIncrease(void) {
	g_FPS += FPS_VER;
	if (g_FPS > FPS_MAX) {
		g_FPS = FPS_MAX;
	}
}

//=============================================================================
// FPS減少
//=============================================================================
void FPSDecrease(void) {
	g_FPS -= FPS_VER;
	if (g_FPS < FPS_MIN) {
		g_FPS = FPS_MIN;
	}
}